{
    "pin": "2923",
    "memorableMoments": [
        {
          "date": "2023-05-04",
          "message": "My eyes got to see the most beautiful girl in human kind for the very first time."
        },
        {
          "date": "2023-05-05",
          "message": "I got to know her name from the front page of her notebook, Aasmi Surya."
        },
        {
          "date": "2023-11-29",
          "message": "The best day of my life. I unexpectedly proposed to Aasmi while walking outside 'The Youth Library 2.0,' and after having a lot of discussion, she accepted my proposal. We were finally dating each other, which was nothing less than a dream."
        },
        {
          "date": "2023-11-23",
          "message": "I decided to talk to Aasmi after 2 months and 20 days because I finally realized what I did to her and how much she had to suffer because of me."
        },
        {
          "date": "2023-12-13",
          "message": "We went on our first 'official' date, starting with having breakfast at Uncle Jack's. Then we headed over to Mittal Mall to have some fun, like going into the Pantaloons store and trying on clothes with no intentions of buying them. We ended the date with having waffles at Belgium Waffles and a small walk at Dadi Poti Park."
        },
        {
          "date": "2024-01-01",
          "message": "Start of the New Year together, although you slept off without even telling me, it's alright as we met in the morning and went to Allen, wished everyone there including teachers, spent some time in Kung Fu Panda. And then I had to drop you off at the bus stand just like a responsible husband, making sure you sat safely on the bus and bidding you goodbye for 2 days."
        },
        {
          "date": "2023-06-08",
          "message": "The day I confessed to Aasmi that I like her, it was over text when she, out of nowhere, directly asked me whether I like her or not. I tried my best to not give an answer and even asked Sameer about the situation, but in the end, I ended up confessing my love for her to her only."
        },
        {
          "date": "2023-07-22",
          "message": "The day when Aasmi confessed her feelings for me, it was late at night, we were both on a call and she was consoling me for something that happened the previous day. Suddenly, I asked her whether she has feelings for me or not. She resisted for a while but ended up confessing it to me."
        },
        {
          "date": "2023-05-26",
          "message": "Today I was going to give Aasmi her birthday presents, a 'Diary' (ohh sorry, Diary) with a written note inside it and a Parker pen. I had been planning this for the last week and was nervous to give it to her, but finally, in the evening while heading back, I gave her both the things in a hurry and asked her to let me know about it on chat, which she, on her own, never did."
        },
        {
          "date": "2023-05-14",
          "message": "I confessed my feelings to Nayamat and Angel (actually not me, it was Armaan who did it). They interrogated me for so long and in the end, I had to bribe them with chocolates in order to help me and keep their mouths shut."
        },
        {
          "date": "2023-05-18",
          "message": "Aasmi and I shared lunch and earphones for the first time, and I remember it was room no. 1, ground floor when I randomly came into the room and Aasmi asked me to sit with her and have lunch. While having it, we decided to listen to songs too. The first song I made her listen to was 'Kahani Suno 2.0', although she hated the song at that time, but afterwards, it was at the top of her liked songs."
        },
        {
          "date": "2023-06-04",
          "message": "It was my and Aasmi's exam on the same day in the same class. She was sitting in the front row and I was at the last one. I barely focused on my exam as I was looking towards her for almost half of the time, and plus, it was an advanced pattern, but still, I made it my best test till date, and obviously, the only reason was the girl sitting there <3."
        },
        {
          "date": "2023-07-13",
          "message": "It was Nayamat's Birthday. I was only the 11th-class person to be invited because I was a part of their group, so it wasn't a big deal for me. As soon as I reached there, all of them started teasing Aasmi, and seeing that, I thought it made Aasmi uncomfortable, so I decided to make some distance with her, which was the worst decision I ever took in my life because taking this decision, there were hell lot of consequences waiting for me ahead."
        },
        {
          "date": "2023-07-18",
          "message": "It was the 5th day since Aasmi and I weren't on talking terms, and I didn't realize how hurt she was because of my actions until I saw her feelings so low and mood so upset. I decided to talk to her and sort things out with her. We both were in the room adjacent to the basement, where she was studying. I went there and took a chair next to her. At the start, she wasn't sharing what happened, but in the end, she finally poured her feelings out, and I made her relaxed and apologized for my bad behavior towards her."
        },
        {
          "date": "2023-12-25",
          "message": "We both went on a date, and trust me, it was the most amazing one. Firstly, we went to a fair. There we got on a ride, and Aasmi was so scared, I can't explain how much she was scared. Then we went to Joggers Park, where we walked and even had a running challenge, which was given by her because she believed that she could beat me in running. I didn't even run properly, I was just jogging, and still, I managed to reach earlier than her, and then after losing, she is putting it on her tight jeans. After that, we went to have Jalebi and then to a cafe to have coffee together."
        },
        {
          "date": "2023-11-24",
          "message": "It was Day 2 when Aasmi and I again started talking, and we were going to meet and talk face to face for the first time. She decided the place, and it was The Youth Library 2.0. Coincidentally, I, Dhruv, and Ajay went there a few days ago, and it was the same library where she used to study in her free time. As I went there, we greeted each other so formally, and it was kind of an awkward meeting. Obviously, we were facing each other after so long, but still, the bond we had never changed, and I am so lucky about it."
        },
        {
          "date": "2023-11-26",
          "message": "We were on the terrace of the Library walking, chit-chatting, talking about how time was when I wasn't there with her, how people near her treated her that time, how was the time with me all that. And suddenly, I don't know from where, but I got that urge to hold her hands, and I asked her for that. She firstly resisted, but then we held hands and walked there for at least 30 mins. After that, when we were going back, a guy came to us and asked whether we were on the terrace walking, we said yes, then he said that it's a restricted area. We firstly panicked, but luckily, no one saw us."
        },
        {
          "date": "2023-09-03",
          "message": "I can say this was the start of the worst phase of my life; time without Aasmi had started. She suddenly cut off and stopped talking to me, although I knew the reason, but still, I wasn't ready to accept that, and I thought that she would come back in 2 or 3 days like she did in the past. But it was my biggest fault to take her for granted, which eventually resulted in this. I still regret that, but it's alright now, here I am trying my best to do whatever is in my hands to make her life the best she could ever ask for."
        },
        {
          "date": "2023-09-18",
          "message": "Today I said so much bad to her, which obviously she never deserved, but it was all said in anger, and I know I did blunder that time. But still, after all this, she was there the next day in front of me, scolding me for all my actions I did in the recent times that wasn't even related to her; it was all my messed-up things that she wanted me to realize and fix before the time is gone. I was hating her the last day, but after that meet, I was regretting every single word I said to her because despite the fight, she was there for me, hoping for my good and caring for me still like my best friend."
        },
        {
          "date": "2023-12-29",
          "message": "It was the time when we celebrated the completion of being together for 1 month. Finally, after so many hurdles in our path, we found the way to each other and stuck to it irrespective of how hard it was. The result was the best. I got her a black top, bracelet (which was actually a couple one, but sadly mine got lost), and some roses. She was looking so pretty in the black top; I was stunned after seeing her in it."
        },
        {
          "date": "2024-01-03",
          "message": "She returned back today, and I was so excited to spend time with her, but unfortunately, it turns out to be the start of our first fight, which was on a serious reason. Although I was given a fake reason, I knew it from the start it's something else, so I somehow got to know the actual reason."
        },
        {
          "date": "2024-01-05",
          "message": "Finally, after 2 days of some serious fight, we both came back on talking terms, and it started with a cute and warming hug given by her when I was sitting in Kung Fu Panda. Although it was a totally unexpected meet arranged by Dhruv without knowing that we both were not talking, but seriously, I thanked him the next day for doing the best work in his entire life."
        },
        {
          "date": "2024-01-24",
          "message": "So it was our last date till now as she was going back to Barnala on 26th and gonna return directly in March after she is done with boards. So we firstly went to the food court had our lunch there and watched a movie on my tab, the movie was my choice (though I forced her to watch, but it's alright I have that right to do). After the movie, we went to spend some time together in a cafe and park to walk around. After that, I dropped her off at her PG and went back home."
        },
        {
          "date": "2024-01-26",
          "message": "It was the morning of 26th when I got to see her for the last time, bidding her a final bye and all the best for her exams coming up. She gave me some of her books which she didn't require. We had tea and spent some time; after that, around 9:30, I dropped her back. As I reached home, my sister got to know that I went to meet Aasmi, and she announced it in front of my parents so that they can know about her. But luckily, my parents, instead of scolding me for it, they also joined her for teasing me on her name; it was all fun, and I was kind of relaxed about it now."
        }
      ],
    "quotes": [
      "“Love is composed of a single soul inhabiting two bodies.” - Aristotle",  
      "“In all the world, there is no heart for me like yours. In all the world, there is no love for you like mine.” - Maya Angelou",
      "“I am who I am because of you. You are every reason, every hope, and every dream I’ve ever had.” - Nicholas Sparks",
      "“You know you’re in love when you can’t fall asleep because reality is finally better than your dreams.” - Dr. Seuss",
      "“The best thing to hold onto in life is each other.” - Audrey Hepburn",
      "“You are the source of my joy, the center of my world, and the whole of my heart.” - Unknown",
      "“Love is not just looking at each other, it’s looking in the same direction.” - Antoine de Saint-Exupéry",
      "“I love you not because of who you are, but because of who I am when I am with you.” - Roy Croft",
      "“The greatest happiness you can have is knowing that you are loved for who you are, and nothing more.” - Angelita Lim",
      "“To love and be loved is to feel the sun from both sides.” - David Viscott",
      "“Love is like the wind, you can’t see it but you can feel it.” - Nicholas Sparks",
      "“You are the answer to every prayer I’ve offered.” - Nicholas Sparks",
      "“I swear I couldn’t love you more than I do right now, and yet I know I will tomorrow.” - Leo Christopher",
      "“Love is an endless mystery, for it has nothing else to explain it.” - Rabindranath Tagore",
      "“My heart is, and always will be, yours.” - Jane Austen"
    ],
    "themes": [
      "#ff6600",
      "#9affe1",
      "#abff9a",
      "#ff9a9a",
      "#f5ff9a",
      "#9aadff",
      "#ffd280",
      "#adff6b",
      "#6bfaff",
      "#55F7DD",
      "#7BF774",
      "#F770F4",
      "#E2F780"
    ]
}
